Revit 2027 API
StructuralAsset.SetPoissonRatio Method
 Sets the Poisson ratio of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetPoissonRatio(
	double poissonRatio
)
Public Sub SetPoissonRatio (
	poissonRatio As Double
)
public:
void SetPoissonRatio(
	double poissonRatio
)
member SetPoissonRatio :
        poissonRatio : float -> unit
Parameters
poissonRatio Double
Remarks
 The Poisson ratio is one-dimensional for wood-based and isotropic materials. This method sets the x, y, and z components to the same value.
See Also
Reference
StructuralAsset Class
Autodesk.Revit.DB Namespace